/********************************************************************
//DM430-A型开发板四位中断按键实验,四个中断按键接在P14~P17上，连接有外部上拉电阻
//4个中断键盘键值显示在数码管上,键值为1~4
//调试环境：EW430 V5.30
//作者：阿迪 www.avrgcc.com
//时间：2011.09.19
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"                       //开发板配置头文件，主要配置IO端口信息

#define KEY_IN    (P1IN & 0xF0)           //键盘口状态输入
uchar KEY_VAL = 0;                        //按键的键值

//***********************************************************************
//               MSP430IO口初始化
//***********************************************************************
void Port_Init()
{
  LED8SEL  = 0x00;                      //设置IO口为普通I/O模式，此句可省
  LED8DIR  = 0xFF;                      //设置IO口方向为输出
  LED8PORT = 0xFF;                      //P2口初始设置为FF
  
  DATASEL  = 0x00;                      //设置IO口为普通I/O模式，此句可省
  DATADIR  = 0xFF;                      //设置IO口方向为输出
  DATAPORT = 0xFF;                      //P4口初始设置为FF
  
  CTRSEL  =  0x00;                      //设置IO口为普通I/O模式，此句可省
  CTRDIR |=  BIT3 + BIT4;               //设置IO口方向为输出,控制口在P63,P64
  CTRPORT =  0xFF;                      //P6口初始设置为FF 
  
  KEYSEL = 0x00;                        //设置IO口为普通I/O模式，此句可省      
  KEYDIR = 0x0F;                        //高四位输入模式，低四位输出模式，外部上拉电阻
  KEYPORT= 0xF0;                        //初始值0xF0
  
  P1IES = 0xF0;                         //P14~P17选择下降沿中断
  P1IE  = 0xF0;                         //打开中断使能
  P1IFG = 0x00;                         //中断标志位清零
}

//*************************************************************************
//	74HC573控制数码管动态扫描键值显示函数
//*************************************************************************

void Display_Key(uchar num)
{
  uchar i,j;
  j=0x01;                             //此数据用来控制位选
  for(i=0;i<3;i++)
  {
    DCTR1;                            //控制数码管段数据的74HC573的LE管脚置高
    WCTR1;                            //控制数码管位的74HC573的LE管脚置高
    DATAPORT=~j;                      //设置要显示的位，也就是哪一个数码管亮
    WCTR0;                            //锁存位数据，下面送上段数据以后，就显示出来了                          
    DATAPORT=table[num];              //送要显示的数据，这里是键值
    DCTR0;                            //锁存段数据，数码管亮一个时间片刻
    j=j<<1;                           //移位，准备进行下一位的显示
    delay_us(500);                    //显示一个时间片刻，会影响亮度和闪烁性
  }
  Close_LED();                        //显示完8个数码管后关闭数码管显示，否则可能导致各个数码管亮度不一致
}

//*************************************************************************
//	中断服务函数
//*************************************************************************
#pragma vector=PORT1_VECTOR
__interrupt void  PORT1_ISR(void)
{
  if(P1IFG & 0xF0)
  {
    switch(P1IFG&0xF0)                   //进行一个与操作，避免判断值出现其他影响
    {
    case 0x10:
    if(KEY_IN == 0xE0)                   //如果是第一个按键被按下
    {
      delay_ms(20);                      //20ms的消抖时间
      if(KEY_IN == 0xE0)
      {
        while(KEY_IN != 0xF0);           //等待键释放
        KEY_VAL = 1;
        P1IFG = 0;
        return;
      }
    }
    
    case 0x20:
      if(KEY_IN == 0xD0)                 //如果是第二个按键被按下
      {
        delay_ms(20);
        if(KEY_IN == 0xD0)
        {
          while(KEY_IN != 0xF0);         //等待键释放
          KEY_VAL = 2;
          P1IFG = 0;
          return;
        }
      }
      
    case 0x40:
      if(KEY_IN == 0xB0)                //如果是第三个按键被按下
      {
        delay_ms(20);
        if(KEY_IN == 0xB0)
        {
          while(KEY_IN != 0xF0);       //等待键释放
          KEY_VAL = 3;
          P1IFG = 0;
          return;
        }
      }
      
    case 0x80:
    if(KEY_IN == 0x70)                 //如果是第四个按键被按下
    {
      delay_ms(20);
      if(KEY_IN == 0x70)
      {
        while(KEY_IN != 0xF0);        //等待键释放
        KEY_VAL = 4;
        P1IFG = 0;
        return;
      }
    }
    
    default:
      while(KEY_IN != 0xF0);          //等待键释放
      P1IFG = 0;
      return;
        }
    }
}

//***********************************************************************
//            主程序
//***********************************************************************
void main(void)
{    
  WDT_Init();                         //看门狗初始化
  Clock_Init();                       //时钟初始化
  Port_Init();                        //端口初始化，用于控制IO口输入或输出
  Close_LED();
  
  _EINT();                            //打开全局中断控制位
  
  while(1)
  {
    Display_Key(KEY_VAL);             //数码管上显示键值
  }
}