/********************************************************************
//DM430-A型开发板使用TIMERA进行UP定时模式实验，最大定时99秒
//程序设置TIMERA每10ms中断一次，定时数据显示在数码管上，请直接查看时间值
//只进行了秒数据定时，如果想实现时钟，请加上小时以及分判断等就可以了
//调试环境：EW430 V5.30
//作者：阿迪 www.avrgcc.com
//时间：2011.09.19
********************************************************************/

#include <msp430x14x.h>
#include "Config.h"                      //开发板配置头文件，主要配置IO端口信息

uchar Flag=0;                            //标志位
uchar Count=0;                           //时间计数变量
uchar Second=0;                          //秒时间变量
//***********************************************************************
//               MSP430IO口初始化
//***********************************************************************
void Port_Init()
{
  LED8SEL  = 0x00;                      //设置IO口为普通I/O模式，此句可省
  LED8DIR  = 0xFF;                      //设置IO口方向为输出
  LED8PORT = 0xFF;                      //P2口初始设置为FF
  
  DATASEL  = 0x00;                      //设置IO口为普通I/O模式，此句可省
  DATADIR  = 0xFF;                      //设置IO口方向为输出
  DATAPORT = 0xFF;                      //P4口初始设置为FF
  
  CTRSEL  =  0x00;                      //设置IO口为普通I/O模式，此句可省
  CTRDIR |=  BIT3 + BIT4;               //设置IO口方向为输出,控制口在P63,P64
  CTRPORT =  0xFF;                      //P6口初始设置为FF
}

//*************************************************************************
//	    74HC573控制数码管动态扫描显示函数
//*************************************************************************

void Display_Time(uchar Time)
{
  uchar i,j;

  j=0x01;                                //此数据用来控制位选
  for(i=0;i<6;i++)                       //用后2位数码管来显示
  {
     DCTR1;                     
     WCTR1;                     
     DATAPORT=~j;                
     WCTR0;                      
     j=(j<<1);
     DATAPORT=0x00;                      //前6位都不显示，送数据00即可
     DCTR0;                      
     delay_ms(2);                
  }
  DCTR1;                                 //开始显示10位
  WCTR1;                    
  DATAPORT=~j;               
  WCTR0;                    
  j=(j<<1);
  DATAPORT=table[Time/10];         
  DCTR0;                    
  delay_ms(1);                        

  DCTR1;                                  //开始显示个位
  WCTR1;                     
  DATAPORT=~j;                
  WCTR0;                      
  j=(j<<1);
  DATAPORT=table[Time%10];           
  DCTR0;                      
  delay_ms(1);                
     
  DCTR1;                     
  WCTR1;                     
  DATAPORT=0xff;                
  WCTR0;                      
}

//***********************************************************************
//             TIMERA初始化，设置为UP模式计数
//***********************************************************************
void TIMERA_Init(void)                                   //UP模式计数，计数周期为CCR0+1
{
  TACTL |= TASSEL1 + TACLR + ID0 + ID1 + MC0 + TAIE;     //SMCLK做时钟源，8分频，增加计数模式，开中断
  TACCR0 = 9999;                                         //CCR0=9999，10ms中断一次
}

//***********************************************************************
//             TIMERA中断服务程序，需要判断中断类型
//***********************************************************************
#pragma vector = TIMERA1_VECTOR
__interrupt void Timer_A(void)
{
  switch(TAIV)                                  //需要判断中断的类型
  {
  case 2:break;
  case 4:break;
  case 10:Count++;break;                         //设置标志位Flag
  }
  if(Count==100)                                 //100次为1秒
  {
    Second++;
    Count=0;
  }
  while(Second>99)Second=0;                       //最大计数99秒
}

//*************************************************************************
//           主函数
//*************************************************************************
void main(void)
{ 
  WDT_Init();                                   //看门狗设置
  Clock_Init();                                 //系统时钟设置
  Port_Init();                                  //端口初始化
  Close_LED();                                  //关闭数码管显示
  TIMERA_Init();                                //设置TIMERA，P12输出PWM信号
  _EINT();                                      //开中断
  while(1)
  {
    Display_Time(Second);                       //显示时间值，最大99秒
  }
}